Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32h72x73x_rcc.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32h72x73x_rcc.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <arch/board/board.h>

#include "arm_internal.h"
#include "stm32_pwr.h"
#include "hardware/stm32_axi.h"
#include "hardware/stm32_flash.h"
#include "hardware/stm32_rcc.h"
#include "hardware/stm32_syscfg.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Allow up to 100 milliseconds for the high speed clock to become ready.
 * that is a very long delay, but if the clock does not become ready we are
 * hosed anyway.  Normally this is very fast, but I have seen at least one
 * board that required this long, long timeout for the HSE to be ready.
 */

#define HSERDY_TIMEOUT (100 * CONFIG_BOARD_LOOPSPERMSEC)

/* Same for HSI */

#define HSIRDY_TIMEOUT HSERDY_TIMEOUT

/* HSE divisor to yield ~1MHz RTC clock */

#define HSE_DIVISOR (STM32_HSE_FREQUENCY + 500000) / 1000000

/* Voltage output scale (default to Scale 0, highest/fastest) */

#ifndef STM32_PWR_VOS_SCALE
#  define STM32_PWR_VOS_SCALE PWR_D3CR_VOS_SCALE_0
#endif

/* FLASH wait states and programming delay (See RM Table 16)
 *
 *  ------------  ----------  -----------  --------
 *     Vcore [V]  ACLK [MHz]  WAIT STATES  WR Delay
 *  ------------  ----------  -----------  --------
 *     0.95-1.05      [0;35]       0          00
 *  (VOS3 range)     ]35;70]       1          01
 *                   ]70;85]       2          10
 *
 *     1.05-1.15      [0;50]       0          00
 *  (VOS2 range)    ]50;100]       1          01
 *                 ]100;150]       2          10
 *
 *     1.15-1.26      [0;67]       0          00
 *  (VOS1 range)    ]67;133]       1          01
 *                 ]133;200]       2          10
 *
 *     1.26-1.40      [0;70]       0          00
 *  (VOS0 range)    ]70;140]       1          01
 *                 ]140;210]       2          10
 *                 ]210;275]       3          11
 *  ------------  ----------  -----------  --------
 */

#if STM32_PWR_VOS_SCALE == PWR_D3CR_VOS_SCALE_3
#  if STM32_ACLK_FREQUENCY <= 35000000
#    define BOARD_FLASH_WAITSTATES   0
#  elif STM32_ACLK_FREQUENCY <= 70000000
#    define BOARD_FLASH_WAITSTATES   1
#  elif STM32_ACLK_FREQUENCY <= 85000000
#    define BOARD_FLASH_WAITSTATES   2
#  else
#    error Invalid VOS for AXI bus clock
#  endif
#elif STM32_PWR_VOS_SCALE == PWR_D3CR_VOS_SCALE_2
#  if STM32_ACLK_FREQUENCY <= 50000000
#    define BOARD_FLASH_WAITSTATES   0
#  elif STM32_ACLK_FREQUENCY <= 100000000
#    define BOARD_FLASH_WAITSTATES   1
#  elif STM32_ACLK_FREQUENCY <= 150000000
#    define BOARD_FLASH_WAITSTATES   2
#  else
#    error Invalid VOS for AXI bus clock
#  endif
#elif STM32_PWR_VOS_SCALE == PWR_D3CR_VOS_SCALE_1
#  if STM32_ACLK_FREQUENCY <= 67000000
#    define BOARD_FLASH_WAITSTATES   0
#  elif STM32_ACLK_FREQUENCY <= 133000000
#    define BOARD_FLASH_WAITSTATES   1
#  elif STM32_ACLK_FREQUENCY <= 200000000
#    define BOARD_FLASH_WAITSTATES   2
#  else
#    error Invalid VOS for AXI bus clock
#  endif
#elif STM32_PWR_VOS_SCALE == PWR_D3CR_VOS_SCALE_0
#  if STM32_ACLK_FREQUENCY <= 70000000
#    define BOARD_FLASH_WAITSTATES   0
#  elif STM32_ACLK_FREQUENCY <= 140000000
#    define BOARD_FLASH_WAITSTATES   1
#  elif STM32_ACLK_FREQUENCY <= 210000000
#    define BOARD_FLASH_WAITSTATES   2
#  elif STM32_ACLK_FREQUENCY <= 275000000
#    define BOARD_FLASH_WAITSTATES   3
#  else
#    error Invalid VOS for AXI bus clock
#  endif
#else
#  error Unknown D3CR VOS scale
#endif

#define BOARD_FLASH_PROGDELAY        BOARD_FLASH_WAITSTATES

/* PLL are only enabled if the P,Q or R outputs are enabled. */

#undef USE_PLL1
#if STM32_PLLCFG_PLL1CFG & (RCC_PLLCFGR_DIVP1EN | RCC_PLLCFGR_DIVQ1EN | \
                            RCC_PLLCFGR_DIVR1EN)
#  define USE_PLL1
#endif

#undef USE_PLL2
#if STM32_PLLCFG_PLL2CFG & (RCC_PLLCFGR_DIVP2EN | RCC_PLLCFGR_DIVQ2EN | \
                            RCC_PLLCFGR_DIVR2EN)
#  define USE_PLL2
#endif

#undef USE_PLL3
#if STM32_PLLCFG_PLL3CFG & (RCC_PLLCFGR_DIVP3EN | RCC_PLLCFGR_DIVQ3EN | \
                            RCC_PLLCFGR_DIVR3EN)
#  define USE_PLL3
#endif

#if defined(STM32_BOARD_USEHSI) && !defined(STM32_BOARD_HSIDIV)
#error When HSI is used, you have to define STM32_BOARD_HSIDIV in board/include/board.h
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rcc_reset
 *
 * Description:
 *   Reset the RCC clock configuration to the default reset state
 *
 ****************************************************************************/

static inline void rcc_reset(void)
{
  uint32_t regval;

  /* Enable the Internal High Speed clock (HSI) */

  regval = getreg32(STM32_RCC_CR);
  regval |= RCC_CR_HSION;
  putreg32(regval, STM32_RCC_CR);

#if defined(CONFIG_STM32H7_AXI_SRAM_CORRUPTION_WAR)
  /* Errata 2.2.9 Enable workaround for Reading from AXI SRAM may lead to
   * data read corruption. See ES0392 Rev 6.
   */

  putreg32(AXI_TARG_READ_ISS_OVERRIDE, STM32_AXI_TARG7_FN_MOD);
#endif

